# Автор: Онищенко Андрей, группа ИУ7-12Б

# Ввод координат точки
x = float(input('Введите значение x: '))
y = float(input('Введите значение y: '))

# Флаг, указывающий на принадлежность точки области
in_area = False

# Проверка верхней части (левое и правое крылья)
if y >= 0:
    # Левое верхнее крыло
    if -9 <= x < -8:
        if 7 * (x + 8) ** 2 + 1 <= y <= -1 / 8 * (x + 9) ** 2 + 8:
            in_area = True
    elif -8 <= x < -1:
        if 1 / 49 * (x + 1) ** 2 <= y <= -1 / 8 * (x + 9) ** 2 + 8:
            in_area = True

    # Правое верхнее крыло (симметрия)
    elif 1 <= x <= 8:
        if 1 / 49 * (x - 1) ** 2 <= y <= -1 / 8 * (x - 9) ** 2 + 8:
            in_area = True
    elif 8 < x <= 9:
        if 7 * (x - 8) ** 2 + 1 <= y <= -1 / 8 * (x - 9) ** 2 + 8:
            in_area = True

# Проверка нижней части (левое и правое крылья)
else:
    # Левое нижнее крыло
    if -8 <= x <= -2:
        if 1 / 3 * (x + 5) ** 2 - 7 <= y <= -1 / 16 * x ** 2:
            in_area = True
    elif -2 < x < -1:
        if -2 * (x + 1) ** 2 - 2 <= y <= -1 / 16 * x ** 2:
            in_area = True
    elif x == -1 and -2 <= y <= 0:
        in_area = True

    # Правое нижнее крыло (симметрия)
    elif x == 1 and -2 <= y <= 0:
        in_area = True
    elif 1 <= x <= 2:
        if -2 * (x - 1) ** 2 - 2 <= y <= -1 / 16 * x ** 2:
            in_area = True
    elif 2 < x <= 8:
        if 1 / 3 * (x - 5) ** 2 - 7 <= y <= -1 / 16 * x ** 2:
            in_area = True

# Проверка "усов" бабочки
if -2 <= x <= 0:
    if y == -3 / 2 * x + 2:
        in_area = True
elif 0 < x <= 2:
    if y == 3 / 2 * x + 2:
        in_area = True

# Проверка тела бабочки
if -1 <= x <= 1:
    if 4 * x ** 2 - 6 <= y <= -4 * x ** 2 + 2:
        in_area = True

# Вывод результата
if in_area:
    print("Точка принадлежит области")
else:
    print("Точка не принадлежит области")
